In [1]:
%load_ext sql

#### Connecting to the Database

In [2]:
%%sql

sqlite:///CourseData.db

'Connected: @CourseData.db'

**We chose a random Instructor ID to test our database with. Anita G. Fernandez was the lucky contestant, and we will be showing the various things that she does as an instructor.**

In [3]:
%%sql

SELECT * FROM INSTRUCTOR WHERE IID = 55;

 * sqlite:///CourseData.db
Done.

[(55, 'Anita G.  Fernandez')]

**You may be asking, how many courses did Anita teach during these different semesters? Well, here are the results.**

In [4]:
%%sql

SELECT DISTINCT Term, COUNT(*) FROM COURSE_OFFERINGS WHERE IID = 55 GROUP BY Term;

 * sqlite:///CourseData.db
Done.

[('Fall2014', 11),
 ('Fall2015', 5),
 ('Fall2017', 1),
 ('Fall2018', 1),
 ('Spring2015', 11),
 ('Spring2016', 3),
 ('Spring2017', 6),
 ('Spring2018', 3),
 ('Spring2019', 3)]

**Now we want to see if our database will spit out the correct classes that Anita teaches. We will only show 12 to save some time.**

In [5]:
%%sql

SELECT COID, CRN, CatalogID, Title, Term
FROM COURSE_OFFERINGS
WHERE IID = 55
LIMIT 12;

 * sqlite:///CourseData.db
Done.

[(123, 73100, 'BI 0170', 'General Biology I (Majors)', 'Fall2014'),
 (124, 73101, 'BI 0170', 'General Biology I (Majors)', 'Fall2014'),
 (125, 71122, 'BI 0170', 'General Biology (Majors)', 'Fall2014'),
 (126, 70339, 'BI 0170', 'General Biology I (Majors)', 'Fall2014'),
 (154, 71640, 'BI 0201', 'Biology Undergraduate Teaching Practicum', 'Fall2014'),
 (155, 72006, 'BI 0202', 'Biology Teaching Practicum', 'Fall2014'),
 (156, 72007, 'BI 0203', 'Biology Teaching Practicum', 'Fall2014'),
 (157, 72895, 'BI 0204', 'Biology Teaching Practicum', 'Fall2014'),
 (158, 72896, 'BI 0205', 'Biology Teaching Practicum', 'Fall2014'),
 (177, 70007, 'BI 0397', 'Internship-201409', 'Fall2014'),
 (178, 72697, 'BI 0397', 'Internships 201409', 'Fall2014'),
 (1646, 76424, 'BI 0170', 'General Biology I', 'Fall2015')]

**Anita taugt 38 distinct classes during her time from Fall 2014 to Spring 2019.**

In [10]:
%%sql

SELECT COUNT (DISTINCT CRN) AS Classes FROM COURSE_OFFERINGS JOIN COURSE_MEETINGS USING (CRN) WHERE IID = 55;

 * sqlite:///CourseData.db
Done.

[(38,)]

**Where does Anita teach most of her classes? Since she is a biology teacher it seems, she is mainly in Bannow, but some classes were taught in DSB surprisingly enough.**

In [7]:
%%sql

SELECT DISTINCT Location, COUNT(*)
FROM LOCATION l
INNER JOIN COURSE_MEETINGS m ON l.LID=m.LID
INNER JOIN COURSE_OFFERINGS z ON m.CRN=z.CRN
WHERE IID = 55
GROUP BY Location;

 * sqlite:///CourseData.db
Done.

[('BI 0170', 4),
 ('BI 0201', 1),
 ('BI 0202', 1),
 ('BI 0203', 1),
 ('BI 0204', 1),
 ('BI 0205', 1),
 ('BI 0397', 2),
 ('BNW 127', 28),
 ('BNW 131', 27),
 ('BNW 238A', 28),
 ('BNW 254', 52),
 ('BNW 256', 131),
 ('BNW 261', 13),
 ('BNW 267', 95),
 ('BNW 333', 27),
 ('BNW 363', 13),
 ('BNW 469', 26),
 ('BNW GR22', 28),
 ('CH 0341L', 1),
 ('CNS 106', 25),
 ('CNS 108', 15),
 ('CNS 15', 25),
 ('CNS 202', 42),
 ('CNS 206', 27),
 ('CNS 9', 26),
 ('DLH 107', 10),
 ('DSB 109', 28),
 ('DSB 114', 14),
 ('DW G108', 14),
 ('GNZ AUDI', 13),
 ('MCA 102', 27),
 ('MCA 204', 26),
 ('SON 124', 28),
 ('SON 203', 208),
 ('SON 214', 56),
 ('VA ', 6),
 ('YAL ', 6)]

**The conclusion that we have come to is that Anita G. Fernandez is a Biology Teacher that primary teaches classes out of the School of Nursing, as well as teach 38 different courses over the past 4.5 years at Fairfield University.**